In [12]:
%run ./00_ghcn_setup.ipynb
# Run this cell to start a spark session in this notebook

start_spark(executor_instances=2, executor_cores=1, worker_memory=1, master_memory=1)

### Assignment 1 ###

The code below demonstrates how to explore and load the data provided for the assignment from Azure Blob Storage and how to save any outputs that you generate to a separate user container.

**Key points**

- The data provided for the assignment is stored in Azure Blob Storage and outputs that you generate will be stored in Azure Blob Storage as well. Hadoop and Spark can both interact with Azure Blob Storage similar to how they interact with HDFS, but where the replication and distribution is handled by Azure instead. This makes it possible to read or write data in Azure over HTTPS where the path is prefixed by `wasbs://`.
- There are two containers, one for the data which is read only and one for any outputs that you generate,
  - `wasbs://campus-data@madsstorage002.blob.core.windows.net/`
  - `wasbs://campus-user@madsstorage002.blob.core.windows.net/`
- You can use variable interpolation to insert your global username variable into paths automatically.
  - This works for bash commands as well.

**Q1** First you will investigate the `daily`, `stations`, `states`, `countries`, and `inventory` data provided  in cloud storage in:
 `wasbs://campus-data@madsstorage002.blob.core.windows.net/ghcnd/`  
using the `hdfs` command.

**(a)** How is the data structured?

In [13]:
%run ./00_ghcn_setup.ipynb
# Run this cell to start a spark session in this notebook

start_spark(executor_instances=2, executor_cores=1, worker_memory=1, master_memory=1)

In [14]:
# Write your imports here or insert cells below

from pyspark.sql import functions as F 
from pyspark.sql.types import *

In [27]:
aDaily         = f'/2025.csv.gz'
prefix         = f'wasbs://{azure_data_container_name}@{azure_account_name}.blob.core.windows.net/ghcnd/'
prefixWrite    = f'wasbs://{azure_data_container_name}@{azure_account_name}.blob.core.windows.net/dew59/'
prefixDaily    = f'{prefix}/daily/'
print(prefix)
print(prefixWrite)
print(prefixDaily)

wasbs://campus-data@madsstorage002.blob.core.windows.net/ghcnd/
wasbs://campus-data@madsstorage002.blob.core.windows.net/dew59/
wasbs://campus-data@madsstorage002.blob.core.windows.net/ghcnd//daily/

In [26]:
from pyspark.sql.functions import col, substring, lit, trim, upper, min as spark_min, max as spark_max

# Reference paths from GHCN
statesPath = f"{prefix}ghcnd-states.txt"
countriesPath = f"{prefix}ghcnd-countries.txt"
stationsPath = f"{prefix}ghcnd-stations.txt"
inventoryPath = f"{prefix}ghcnd-inventory.txt"

# Load metadata
statesdf = spark.read.text(statesPath)
countriesdf = spark.read.text(countriesPath)
stationsdf = spark.read.text(stationsPath)
inventorydf = spark.read.text(inventoryPath)

show_as_html(statesdf.limit(5))
show_as_html(countriesdf.limit(5))
show_as_html(stationsdf.limit(5))
show_as_html(inventorydf.limit(5))

# Parse states
statesdf = statesdf.select(
    trim(substring("value", 1, 2)).alias("CODE"),
    trim(substring("value", 4, 50)).alias("STATE_NAME")
)
show_as_html(statesdf.limit(5))

# Parse countries
countriesdf = countriesdf.select(
    trim(substring("value", 1, 2)).alias("CODE"),
    trim(substring("value", 4, 50)).alias("COUNTRY_NAME")
)
show_as_html(countriesdf.limit(5))

# Parse stations
stationsdf = spark.read.text(stationsPath)
stationsdf = stationsdf.select(
    trim(substring("value", 1, 11)).alias("ID"),
    trim(substring("value", 13, 8)).cast("double").alias("LATITUDE"),
    trim(substring("value", 22, 8)).cast("double").alias("LONGITUDE"),
    trim(substring("value", 31, 6)).cast("double").alias("ELEVATION"),
    trim(substring("value", 39, 2)).alias("STATE"),
    trim(substring("value", 42, 30)).alias("NAME"),
    trim(substring("value", 72, 3)).alias("GSNFLAG"),
    trim(substring("value", 75, 3)).alias("HCNFLAG"),
    trim(substring("value", 78, 5)).alias("WMOID")
)
show_as_html(stationsdf.limit(5))

# Add country code
stations_with_code = stationsdf.withColumn("COUNTRY_CODE", substring("ID", 1, 2))
show_as_html(stations_with_code.limit(5))

# Join with countries
station_country_joined = stations_with_code.join(
    countriesdf,
    stations_with_code["COUNTRY_CODE"] == countriesdf["CODE"],
    how="left"
).drop(countriesdf["CODE"])
show_as_html(station_country_joined.limit(5))

# Separate US and non-US
us_stations = station_country_joined.filter(col("COUNTRY_CODE") == "US")
non_us_stations = station_country_joined.filter(col("COUNTRY_CODE") != "US") \
    .withColumn("STATE_NAME", lit(None).cast("string"))
show_as_html(us_stations.limit(5))

# Join US stations with states
us_stations_clean = us_stations.withColumn("STATE_CLEAN", upper(trim(col("STATE"))))
show_as_html(us_stations_clean.limit(5))

us_stations_joined = us_stations_clean.join(
    statesdf,
    trim(us_stations_clean["STATE_CLEAN"]) == trim(statesdf["CODE"]),
    how="left"
).drop("STATE_CLEAN", statesdf["CODE"])
show_as_html(us_stations_joined.limit(5))

# Merge
stations_full = us_stations_joined.unionByName(non_us_stations)
show_as_html(stations_full.limit(5))

# Final preview
stations_select = stations_full.select("ID", "COUNTRY_CODE", "COUNTRY_NAME", "STATE", "STATE_NAME")
stations_select.orderBy("COUNTRY_CODE", "STATE", "ID").show(10, truncate=False)
show_as_html(stations_select.limit(5))

                                               value
0                                         AB ALBERTA
1                                          AK ALASKA
2  AL ALABAMA                                    ...
3                                        AR ARKANSAS
4                                  AS AMERICAN SAMOA

                      value
0   AC Antigua and Barbuda
1  AE United Arab Emirates
2            AF Afghanistan
3               AG Algeria
4            AJ Azerbaijan

                                               value
0  ACW00011604  17.1167  -61.7833   10.1    ST JO...
1  ACW00011647  17.1333  -61.7833   19.2    ST JO...
2  AE000041196  25.3330   55.5170   34.0    SHARJ...
3  AEM00041194  25.2550   55.3640   10.4    DUBAI...
4  AEM00041217  24.4330   54.6510   26.8    ABU D...

                                           value
0  ACW00011604  17.1167  -61.7833 TMAX 1949 1949
1  ACW00011604  17.1167  -61.7833 TMIN 1949 1949
2  ACW00011604  17.1167  -61.7833 PRCP 1949 1949
3  ACW00011604  17.1167  -61.7833 SNOW 1949 1949
4  ACW00011604  17.1167  -61.7833 SNWD 1949 1949

  CODE      STATE_NAME
0   AB         ALBERTA
1   AK          ALASKA
2   AL         ALABAMA
3   AR        ARKANSAS
4   AS  AMERICAN SAMOA

  CODE          COUNTRY_NAME
0   AC   Antigua and Barbuda
1   AE  United Arab Emirates
2   AF           Afghanistan
3   AG               Algeria
4   AJ            Azerbaijan

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID
0,ACW00011604,17.1167,-61.783,10.0,,ST JOHNS COOLIDGE FLD,,,
1,ACW00011647,17.1333,-61.783,19.0,,ST JOHNS,,,
2,AE000041196,25.3330,55.517,34.0,,SHARJAH INTER. AIRP,GS,N,41
3,AEM00041194,25.2550,55.364,10.0,,DUBAI INTL,,,41
4,AEM00041217,24.4330,54.651,26.0,,ABU DHABI INTL,,,41

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE
0,ACW00011604,17.1167,-61.783,10.0,,ST JOHNS COOLIDGE FLD,,,,AC
1,ACW00011647,17.1333,-61.783,19.0,,ST JOHNS,,,,AC
2,AE000041196,25.3330,55.517,34.0,,SHARJAH INTER. AIRP,GS,N,41,AE
3,AEM00041194,25.2550,55.364,10.0,,DUBAI INTL,,,41,AE
4,AEM00041217,24.4330,54.651,26.0,,ABU DHABI INTL,,,41,AE

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE,COUNTRY_NAME
0,ACW00011604,17.1167,-61.783,10.0,,ST JOHNS COOLIDGE FLD,,,,AC,Antigua and Barbuda
1,ACW00011647,17.1333,-61.783,19.0,,ST JOHNS,,,,AC,Antigua and Barbuda
2,AE000041196,25.3330,55.517,34.0,,SHARJAH INTER. AIRP,GS,N,41,AE,United Arab Emirates
3,AEM00041194,25.2550,55.364,10.0,,DUBAI INTL,,,41,AE,United Arab Emirates
4,AEM00041217,24.4330,54.651,26.0,,ABU DHABI INTL,,,41,AE,United Arab Emirates

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE,COUNTRY_NAME
0,US009052008,43.7333,-96.633,482.0,SD,SIOUX FALLS (ENVIRON. CANADA),,,,US,United States
1,US10RMHS145,40.5268,-105.111,1569.0,CO,RMHS 1.6 SSW,,,,US,United States
2,US10adam001,40.5680,-98.506,598.0,NE,JUNIATA 1.5 S,,,,US,United States
3,US10adam002,40.5093,-98.549,601.0,NE,JUNIATA 6.0 SSW,,,,US,United States
4,US10adam003,40.4663,-98.653,615.0,NE,HOLSTEIN 0.1 NW,,,,US,United States

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE,COUNTRY_NAME,STATE_CLEAN
0,US009052008,43.7333,-96.633,482.0,SD,SIOUX FALLS (ENVIRON. CANADA),,,,US,United States,SD
1,US10RMHS145,40.5268,-105.111,1569.0,CO,RMHS 1.6 SSW,,,,US,United States,CO
2,US10adam001,40.5680,-98.506,598.0,NE,JUNIATA 1.5 S,,,,US,United States,NE
3,US10adam002,40.5093,-98.549,601.0,NE,JUNIATA 6.0 SSW,,,,US,United States,NE
4,US10adam003,40.4663,-98.653,615.0,NE,HOLSTEIN 0.1 NW,,,,US,United States,NE

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE,COUNTRY_NAME,STATE_NAME
0,US009052008,43.7333,-96.633,482.0,SD,SIOUX FALLS (ENVIRON. CANADA),,,,US,United States,SOUTH DAKOTA
1,US10RMHS145,40.5268,-105.111,1569.0,CO,RMHS 1.6 SSW,,,,US,United States,COLORADO
2,US10adam001,40.5680,-98.506,598.0,NE,JUNIATA 1.5 S,,,,US,United States,NEBRASKA
3,US10adam002,40.5093,-98.549,601.0,NE,JUNIATA 6.0 SSW,,,,US,United States,NEBRASKA
4,US10adam003,40.4663,-98.653,615.0,NE,HOLSTEIN 0.1 NW,,,,US,United States,NEBRASKA

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE,COUNTRY_NAME,STATE_NAME
0,US009052008,43.7333,-96.633,482.0,SD,SIOUX FALLS (ENVIRON. CANADA),,,,US,United States,SOUTH DAKOTA
1,US10RMHS145,40.5268,-105.111,1569.0,CO,RMHS 1.6 SSW,,,,US,United States,COLORADO
2,US10adam001,40.5680,-98.506,598.0,NE,JUNIATA 1.5 S,,,,US,United States,NEBRASKA
3,US10adam002,40.5093,-98.549,601.0,NE,JUNIATA 6.0 SSW,,,,US,United States,NEBRASKA
4,US10adam003,40.4663,-98.653,615.0,NE,HOLSTEIN 0.1 NW,,,,US,United States,NEBRASKA

+-----------+------------+--------------------+-----+----------+
|ID         |COUNTRY_CODE|COUNTRY_NAME        |STATE|STATE_NAME|
+-----------+------------+--------------------+-----+----------+
|ACW00011604|AC          |Antigua and Barbuda |     |NULL      |
|ACW00011647|AC          |Antigua and Barbuda |     |NULL      |
|AE000041196|AE          |United Arab Emirates|     |NULL      |
|AEM00041194|AE          |United Arab Emirates|     |NULL      |
|AEM00041217|AE          |United Arab Emirates|     |NULL      |
|AEM00041218|AE          |United Arab Emirates|     |NULL      |
|AF000040930|AF          |Afghanistan         |     |NULL      |
|AFM00040938|AF          |Afghanistan         |     |NULL      |
|AFM00040948|AF          |Afghanistan         |     |NULL      |
|AFM00040990|AF          |Afghanistan         |     |NULL      |
+-----------+------------+--------------------+-----+----------+
only showing top 10 rows

            ID COUNTRY_CODE   COUNTRY_NAME STATE    STATE_NAME
0  US009052008           US  United States    SD  SOUTH DAKOTA
1  US10RMHS145           US  United States    CO      COLORADO
2  US10adam001           US  United States    NE      NEBRASKA
3  US10adam002           US  United States    NE      NEBRASKA
4  US10adam003           US  United States    NE      NEBRASKA

In [17]:


inventorydf = spark.read.text(inventoryPath)

inventorydf = inventorydf.select(
    trim(substring("value", 1, 11)).alias("ID"),
    trim(substring("value", 13, 9)).cast("double").alias("LATITUDE"),
    trim(substring("value", 22, 10)).cast("double").alias("LONGITUDE"),
    trim(substring("value", 33, 4)).alias("ELEMENT"),
    trim(substring("value", 37, 4)).cast("int").alias("FIRSTYEAR"),
    trim(substring("value", 42, 4)).cast("int").alias("LASTYEAR")
)
show_as_html(inventorydf.limit(5))

# Aggregate by station ID
station_years = inventorydf.groupBy("ID").agg(
    spark_min("FIRSTYEAR").alias("FIRST_ACTIVE_YEAR"),
    spark_max("LASTYEAR").alias("LAST_ACTIVE_YEAR")
)
show_as_html(station_years.orderBy("ID").limit(10))

stations_select = stations_full.select("ID", "COUNTRY_CODE", "COUNTRY_NAME", "STATE", "STATE_NAME")
#stations_select.orderBy("COUNTRY_CODE", "STATE", "ID").show(10, truncate=False)
show_as_html(stations_select.limit(5))

# Total number of stations
total_stations = stations_select.select("ID").distinct().count()
print(f"Total number of stations: {total_stations}")

# Stations active in 2024 (from inventory)
stations_2024 = inventorydf.filter(inventorydf["LASTYEAR"] >= 2024).select("ID").distinct().count()
print(f"Number of stations active in 2024: {stations_2024}")

            ID  LATITUDE  LONGITUDE ELEMENT  FIRSTYEAR  LASTYEAR
0  ACW00011604   17.1167   -61.7833     MAX       1949      1949
1  ACW00011604   17.1167   -61.7833     MIN       1949      1949
2  ACW00011604   17.1167   -61.7833     RCP       1949      1949
3  ACW00011604   17.1167   -61.7833     NOW       1949      1949
4  ACW00011604   17.1167   -61.7833     NWD       1949      1949

            ID  FIRST_ACTIVE_YEAR  LAST_ACTIVE_YEAR
0  ACW00011604               1949              1949
1  ACW00011647               1957              1970
2  AE000041196               1944              2025
3  AEM00041194               1983              2025
4  AEM00041217               1983              2025
5  AEM00041218               1994              2025
6  AF000040930               1973              1992
7  AFM00040938               1973              2021
8  AFM00040948               1966              2021
9  AFM00040990               1973              2020

            ID COUNTRY_CODE   COUNTRY_NAME STATE    STATE_NAME
0  US009052008           US  United States    SD  SOUTH DAKOTA
1  US10RMHS145           US  United States    CO      COLORADO
2  US10adam001           US  United States    NE      NEBRASKA
3  US10adam002           US  United States    NE      NEBRASKA
4  US10adam003           US  United States    NE      NEBRASKA

Total number of stations: 129657
Number of stations active in 2024: 42372

In [18]:
# Load a small subset of daily (e.g. 1840)
dailySchema = StructType([
    StructField("ID", StringType(), False),
    StructField("DATE", StringType(), False),
    StructField("ELEMENT", StringType(), True),
    StructField("VALUE", IntegerType(), True),
    StructField("MFLAG", StringType(), True),
    StructField("QFLAG", StringType(), True),
    StructField("SFLAG", StringType(), True),
    StructField("OBS_TIME", StringType(), True)
])



dailyPath = f"{prefixDaily}1840.csv.gz"
dailydf   = spark.read.csv(dailyPath, schema=dailySchema, header=False)
dailydf.printSchema()
show_as_html(dailydf.limit(5))

root
 |-- ID: string (nullable = true)
 |-- DATE: string (nullable = true)
 |-- ELEMENT: string (nullable = true)
 |-- VALUE: integer (nullable = true)
 |-- MFLAG: string (nullable = true)
 |-- QFLAG: string (nullable = true)
 |-- SFLAG: string (nullable = true)
 |-- OBS_TIME: string (nullable = true)

            ID      DATE ELEMENT  VALUE MFLAG QFLAG SFLAG OBS_TIME
0  ASN00023000  18400101    PRCP      0  None  None     a     None
1  SWE00139148  18400101    TMIN    -97  None  None     E     None
2  SWE00139148  18400101    PRCP      0  None  None     E     None
3  EZE00100082  18400101    TMAX     -4  None  None     E     None
4  EZE00100082  18400101    TMIN    -22  None  None     E     None

In [19]:
# Add country code
stations_with_code = stationsdf.withColumn("COUNTRY_CODE", substring("ID", 1, 2))
show_as_html(stations_with_code.limit(5))

# Join with countries
station_country_joined = stations_with_code.join(
    countriesdf,
    stations_with_code["COUNTRY_CODE"] == countriesdf["CODE"],
    how="left"
).drop(countriesdf["CODE"])
show_as_html(station_country_joined.limit(5))

# Separate US and non-US
us_stations = station_country_joined.filter(col("COUNTRY_CODE") == "US")
non_us_stations = station_country_joined.filter(col("COUNTRY_CODE") != "US") \
    .withColumn("STATE_NAME", lit(None).cast("string"))
show_as_html(us_stations.limit(5))

# Join US stations with states
us_stations_clean = us_stations.withColumn("STATE_CLEAN", upper(trim(col("STATE"))))
show_as_html(us_stations_clean.limit(5))

us_stations_joined = us_stations_clean.join(
    statesdf,
    trim(us_stations_clean["STATE_CLEAN"]) == trim(statesdf["CODE"]),
    how="left"
).drop("STATE_CLEAN", statesdf["CODE"])
show_as_html(us_stations_joined.limit(5))

# Merge
stations_full = us_stations_joined.unionByName(non_us_stations)
show_as_html(stations_full.limit(5))

# Final preview
stations_select = stations_full.select("ID", "COUNTRY_CODE", "COUNTRY_NAME", "STATE", "STATE_NAME")
#stations_select.orderBy("COUNTRY_CODE", "STATE", "ID").show(10, truncate=False)
show_as_html(stations_select.limit(5))

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE
0,ACW00011604,17.1167,-61.783,10.0,,ST JOHNS COOLIDGE FLD,,,,AC
1,ACW00011647,17.1333,-61.783,19.0,,ST JOHNS,,,,AC
2,AE000041196,25.3330,55.517,34.0,,SHARJAH INTER. AIRP,GS,N,41,AE
3,AEM00041194,25.2550,55.364,10.0,,DUBAI INTL,,,41,AE
4,AEM00041217,24.4330,54.651,26.0,,ABU DHABI INTL,,,41,AE

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE,COUNTRY_NAME
0,ACW00011604,17.1167,-61.783,10.0,,ST JOHNS COOLIDGE FLD,,,,AC,Antigua and Barbuda
1,ACW00011647,17.1333,-61.783,19.0,,ST JOHNS,,,,AC,Antigua and Barbuda
2,AE000041196,25.3330,55.517,34.0,,SHARJAH INTER. AIRP,GS,N,41,AE,United Arab Emirates
3,AEM00041194,25.2550,55.364,10.0,,DUBAI INTL,,,41,AE,United Arab Emirates
4,AEM00041217,24.4330,54.651,26.0,,ABU DHABI INTL,,,41,AE,United Arab Emirates

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE,COUNTRY_NAME
0,US009052008,43.7333,-96.633,482.0,SD,SIOUX FALLS (ENVIRON. CANADA),,,,US,United States
1,US10RMHS145,40.5268,-105.111,1569.0,CO,RMHS 1.6 SSW,,,,US,United States
2,US10adam001,40.5680,-98.506,598.0,NE,JUNIATA 1.5 S,,,,US,United States
3,US10adam002,40.5093,-98.549,601.0,NE,JUNIATA 6.0 SSW,,,,US,United States
4,US10adam003,40.4663,-98.653,615.0,NE,HOLSTEIN 0.1 NW,,,,US,United States

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE,COUNTRY_NAME,STATE_CLEAN
0,US009052008,43.7333,-96.633,482.0,SD,SIOUX FALLS (ENVIRON. CANADA),,,,US,United States,SD
1,US10RMHS145,40.5268,-105.111,1569.0,CO,RMHS 1.6 SSW,,,,US,United States,CO
2,US10adam001,40.5680,-98.506,598.0,NE,JUNIATA 1.5 S,,,,US,United States,NE
3,US10adam002,40.5093,-98.549,601.0,NE,JUNIATA 6.0 SSW,,,,US,United States,NE
4,US10adam003,40.4663,-98.653,615.0,NE,HOLSTEIN 0.1 NW,,,,US,United States,NE

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE,COUNTRY_NAME,STATE_NAME
0,US009052008,43.7333,-96.633,482.0,SD,SIOUX FALLS (ENVIRON. CANADA),,,,US,United States,SOUTH DAKOTA
1,US10RMHS145,40.5268,-105.111,1569.0,CO,RMHS 1.6 SSW,,,,US,United States,COLORADO
2,US10adam001,40.5680,-98.506,598.0,NE,JUNIATA 1.5 S,,,,US,United States,NEBRASKA
3,US10adam002,40.5093,-98.549,601.0,NE,JUNIATA 6.0 SSW,,,,US,United States,NEBRASKA
4,US10adam003,40.4663,-98.653,615.0,NE,HOLSTEIN 0.1 NW,,,,US,United States,NEBRASKA

,ID,LATITUDE,LONGITUDE,ELEVATION,STATE,NAME,GSNFLAG,HCNFLAG,WMOID,COUNTRY_CODE,COUNTRY_NAME,STATE_NAME
0,US009052008,43.7333,-96.633,482.0,SD,SIOUX FALLS (ENVIRON. CANADA),,,,US,United States,SOUTH DAKOTA
1,US10RMHS145,40.5268,-105.111,1569.0,CO,RMHS 1.6 SSW,,,,US,United States,COLORADO
2,US10adam001,40.5680,-98.506,598.0,NE,JUNIATA 1.5 S,,,,US,United States,NEBRASKA
3,US10adam002,40.5093,-98.549,601.0,NE,JUNIATA 6.0 SSW,,,,US,United States,NEBRASKA
4,US10adam003,40.4663,-98.653,615.0,NE,HOLSTEIN 0.1 NW,,,,US,United States,NEBRASKA

            ID COUNTRY_CODE   COUNTRY_NAME STATE    STATE_NAME
0  US009052008           US  United States    SD  SOUTH DAKOTA
1  US10RMHS145           US  United States    CO      COLORADO
2  US10adam001           US  United States    NE      NEBRASKA
3  US10adam002           US  United States    NE      NEBRASKA
4  US10adam003           US  United States    NE      NEBRASKA

In [20]:
station_element_counts = inventorydf.groupBy("ID").agg(
    F.countDistinct("ELEMENT").alias("NUM_ELEMENTS")
)

show_as_html(station_element_counts.orderBy("ID").limit(10))

# Total number of elements across all stations
total_element_count = station_element_counts.agg(
    F.sum("NUM_ELEMENTS").alias("TOTAL_ELEMENTS")
)

show_as_html(total_element_count)

            ID  NUM_ELEMENTS
0  ACW00011604            11
1  ACW00011647             7
2  AE000041196             4
3  AEM00041194             4
4  AEM00041217             4
5  AEM00041218             4
6  AF000040930             5
7  AFM00040938             5
8  AFM00040948             5
9  AFM00040990             5

   TOTAL_ELEMENTS
0          765258

In [24]:
# --- Q4(a): Find stations in daily that are not in stations_enriched ---

dailyPath = f"{prefixDaily}1840.csv.gz"
dailydf   = spark.read.csv(dailyPath, schema=dailySchema, header=False)
stations_enriched = stations_select.join(
    station_element_counts,
    on="ID",
    how="left"
)
print("stations_enriched")
show_as_html(stations_enriched.limit(5))

print("Extract distinct station IDs from daily data")
daily_station_ids = dailydf.select("ID").distinct()
show_as_html(daily_station_ids.limit(5))

# LEFT JOIN with enriched stations
print("LEFT JOIN with enriched stations")
daily_station_ids = dailydf.select("ID").distinct()
show_as_html(daily_station_ids.limit(5))

# Step 2: Get distinct station IDs from stations_enriched and rename column
print("Get distinct station IDs from stations_enriched and rename column")
enriched_station_ids = stations_enriched.select("ID").distinct().withColumnRenamed("ID", "station_ID")
show_as_html(enriched_station_ids.limit(5))

# Step 3: Perform the LEFT JOIN
print("Perform the LEFT JOIN")
missing_station_join = daily_station_ids.join(
    enriched_station_ids,
    daily_station_ids["ID"] == enriched_station_ids["station_ID"],
    how="left"
)
show_as_html(missing_station_join.limit(5))

# Filter where there was no match (i.e. not in stations_enriched)
missing_station_ids = missing_station_join.filter(F.col("station_ID").isNull()).select("ID")

# Show a preview of missing stations
show_as_html(missing_station_ids.limit(10))

# Count how many stations from daily are not in stations_enriched
missing_station_count = missing_station_ids.count()
print(f"Number of stations in daily that are missing from stations_enriched: {missing_station_count}")

stations_enriched

            ID COUNTRY_CODE   COUNTRY_NAME STATE      STATE_NAME  NUM_ELEMENTS
0  US1SCBF0015           US  United States    SC  SOUTH CAROLINA             4
1  US1SCBF0016           US  United States    SC  SOUTH CAROLINA             4
2  US1SCBF0007           US  United States    SC  SOUTH CAROLINA             4
3  US1SCBF0022           US  United States    SC  SOUTH CAROLINA             5
4  US1SCBF0010           US  United States    SC  SOUTH CAROLINA             6

Extract distinct station IDs from daily data

            ID
0  ITE00100550
1  UK000047811
2  GM000004204
3  ITE00100554
4  USC00361920

LEFT JOIN with enriched stations

            ID
0  ITE00100550
1  UK000047811
2  GM000004204
3  ITE00100554
4  USC00361920

Get distinct station IDs from stations_enriched and rename column

    station_ID
0  US10adam013
1  US10adam019
2  US10adam025
3  US10adam035
4  US10adam043

Perform the LEFT JOIN

            ID   station_ID
0  ITE00100550  ITE00100550
1  UK000047811  UK000047811
2  GM000004204  GM000004204
3  ITE00100554  ITE00100554
4  USC00361920  USC00361920

Empty DataFrame
Columns: [ID]
Index: []

Number of stations in daily that are missing from stations_enriched: 0